{
  "creations": [{
      "name": "The Cookie Game",
      "description": "This is the Cookie Game. It is a game where you click a cookie. When you click it, you get a cookie! With certain amounts of cookies, you can buy things that make cookies by themselves. You think it is pointless? Well it is, you aren't wrong :)",
      "link": "http://www.tylertracy.com/Play/The_Cookie_Game",
      "type": "game",
      "img": "http://www.tylertracy.com/Play/The_Cookie_Game_Thumbnail.png"
    },
    {
      "name": "Number Stats",
      "description": "Here is an application where you enter a number, and then press enter. Then it tells you every possible thing you want to know about that number. Don't enter a number above a billion, unless you have the time to wait.",
      "link": "http://www.tylertracy.com/Play/Number_Stats",
      "type": "game",
      "img": "http://www.tylertracy.com/Play/Number_Stats_Thumbnail.png"
    },
    {
      "name": "Rubik's Cube Simulator",
      "description": "A 3d Rubiks cube simulator made from css and javascript",
      "link": "https://tgt101.com/cube",
      "type": "game",
      "img": "http://tgt101.com/images/cube.png"
    },
    {
      "name": "Battle Balls",
      "description": "This is a multi-player game. You play on the same board as your opponent and you shoot him until he disappears",
      "link": "http://www.tylertracy.com/Play/Battle_Balls",
      "type": "game",
      "img": "http://www.tylertracy.com/Play/Number_Stats_Thumbnail.png"
    },
    {
      "name": "Derivative Dash",
      "description": "Warning, A basic understanding of calculus is required. This game test if you know the fundamentals of calculus",
      "link": "http://www.tylertracy.com/Play/Derivative_Dash",
      "type": "game",
      "img": "http://www.tylertracy.com/Play/Derivative_Dash_Thumbnail.png"
    },
    {
      "name": "Binary Blitz",
      "description": "How quickly can you convert a base ten number into binary? Find out here",
      "link": "http://www.tylertracy.com/Play/Binary_Blitz",
      "type": "game",
      "img": "http://www.tylertracy.com/Play/Binary_Blitz_Thumbnail.png"
    },
    {
      "name": "Tyler Cards",
      "description": "This is my first multiplayer game. It only has slap jack right now, but i might add more games later. I'm releasing this on my 17th birthday. It works, but not all the time. There are anti-spam measures put in, so don't screw around or you will lose. Make sure to read the info.",
      "link": "http://www.tylertracy.com/Play/Tyler_Cards",
      "type": "game",
      "img": "http://www.tylertracy.com/Play/Tyler_Cards_Thumbnail.png"
    },
    {
      "name": "Tyler Tower",
      "description": "Defend America from the terrorist! This game is no where near done, I just wanted to get my game out there. I plan to have weapons be upgradable and more types of weapons.",
      "link": "http://www.tylertracy.com/Play/Tyler_Tower",
      "type": "game",
      "img": "http://www.tylertracy.com/Play/Tyler_Tower_Thumbnail.png"
    },
    {
      "name": "OmniType",
      "description": "How fast can you type letters on a keyboard? What about symbols? Find out in this game",
      "link": "http://www.tylertracy.com/Play/OmniType",
      "type": "game",
      "img": "http://www.tylertracy.com/Play/OmniType_Thumbnail.png"
    }
  ],
  "RPS_V2": {
    "description": "I'm sure everyone has played Rock Paper Scissors before. This puts a new twist on the game. It adds many other versions of the game. Try it out and see if you can discover all the possible outcomes."
  },
  "Tyler Talk": {
    "description": "This is a chat system that I created. It was the first real thing I created with PHP. I have big plans for it."
  },
  "Type Your Name": {
    "description": "This is a game where you enter your name, then you enter it again as fast as you can. But the second time there is a twist."
  },
  "Click The Ball": {
    "description": "As the name suggests, this is a game where you click a ball. The ball is randomly moving and it is surprisingly hard to hit. It seems stupid and it kind of is. But this was something I used to teach someone how to code. So that is always a positive."
  },
  "Key Hero": {
    "description": "This is a knock off of guitar hero. This again is a program that I created while teaching someone to code(it also shows how I love light blue as a background color).In this game you hit the correct key that is moving across the screen right when it enters the circle. If you are too slow or too fast then you lose a point. This game is very simple right now, and I am probably going to come back and make it cooler."
  },
  "Cube Position": {
    "description": "This is a game where you position a Rubik's cube with w,a,s,d and rotate it with q and e. You have to line it up with the other cube and make them be directly on top of each other. Hailey Smith and I built this game in about two hours"
  },
  "Homework Helper": {
    "description": "This is a thing I made in my early years, you can tell by my amazing styling. It has a bunch of formulas that can solve for area and volume and other things."
  },
  "Random Sentence": {
    "description": "This program creates random sentences. It has some grammar in it, but not much."
  },
  "Flat Cube": {
    "description": "This is a game that took some tricky css to make. It simulates a Rubik's Cube. You can move it in all directions and then try to solve it. This probably wont work on all screen sizes. So beware of what is to come."
  },
  "Encryption": {
    "description": "This is a program that takes words you input and treats it like base 36 and then converts it to a base 2016. It uses the charatcters from unicode for each digit. This is not real encyrption, just an idea I had. Do not actually use this to encrypt your data",
    "inProgress": true
  }

}